# -*- coding: cp1251 -*-
from Dangeon_Room import *
import os

Player_answer = ""

print("=====================================================")
print("Приветствую в игре Dangeon and Dangeon")
print("=====================================================\n")

print("=====================================================")
print("Внимание! Выбор осуществляется путём ввода целочисленных значений.\nВвод буквенных или дробных значений может вызвать ошибку.\nПример:\n")
print("1. Атака\n2. Защита\n")
print("1")
print("=====================================================\n")

ExitMainMenu = 0
while ExitMainMenu == 0:

    print("=====================================================")
    print("Main Menu\n")
    print("     1. Начать новую игру")
    print("     2. Продолжить игру ( в разработке )")
    print("     3. Справочник")
    print("     4. Авторы")
    print("     5. Выход")
    print("=====================================================\n")

    Player_answer = input()

    if Player_answer == "1":

        print("=====================================================")
        print("     1. Покоритель ( в разработке )")
        print("     2. Покорённый ( в разработке )")
        print("     3. Хранитель ( в разработке )")
        print("     4. Наблюдатель ( в разработке )")
        print("")
        print("     5. Назад")
        print("=====================================================\n")

        Player_answer = input()

        if Player_answer == "1":
            print("Выбран режим Покорителя.")
            os.system('"D:\Games\Quake III\quake3.exe"')